//  Задание и видеоурок здесь: https://lms.synergy.ru/student/updiscipline/4474947/1045153/1/1
//  Название урока: Урок 6. Ключевое слово final
public class Draft0_Whole_Video_2_6_0 {

//        Пример 4 ППППППППППППППППППППППППППППППППППП
//        Присвоение по ссылке. Меняем значение по калькулятору: видео мин 12.43
//        Конец Примера 4 КККККККККККККККК





//        Пример 3.4. ППППППППППППППППППППППППППППППППППП
//        Задать массив статический можно в таком виде: видео мин 10.56
//        int[] b = new int[] {1, 2, 3};
//        Конец Примера 3.4. КККККККККККККККК







//        Пример 3.4. ППППППППППППППППППППППППППППППППППП
//        Найти максимальное значение в массиве ( max ): видео мин 06.20
//        Конец Примера 3.4. КККККККККККККККК






//        Пример 3.3. ППППППППППППППППППППППППППППППППППП
//        Сделать массив final'ом: видео мин 10.12
//        Конец Примера 3.3. КККККККККККККККК





//        Пример 3.2. ППППППППППППППППППППППППППППППППППП
//        Массив b = a: видео мин 20.48
//        Конец Примера 3.2. КККККККККККККККК





//        Пример 3 ППППППППППППППППППППППППППППППППППП
//        Как вводится статический массив через цикл for: Теперь давайте введём этот массив:
//        И как найти наибольший элемент массива: видео мин 06.20
//        Конец Примера 3 КККККККККККККККК





//        Пример 2 ППППППППППППППППППППППППППППППППППП
//        Программа, где пользователь вводит размер массива: видео мин 05.21
//        Конец Примера 2 КККККККККККККККК





//        Пример 1.2. ППППППППППППППППППППППППППППППППППП
//        Сравнение int и final int: видео мин 02.01
//        Конец Примера 1.2. КККККККККККККККК





//        Пример 1 ППППППППППППППППППППППППППППППППППП
//        Как объявлять модификатор final: видео мин 02.11
//        Конец Примера 1 КККККККККККККККК







}
